### **Imports**

In [1]:
pip install sqlalchemy_utils

Requirement already satisfied: sqlalchemy_utils in c:\users\x473970\appdata\local\anaconda3\lib\site-packages (0.41.1)
Requirement already satisfied: SQLAlchemy>=1.3 in c:\users\x473970\appdata\local\anaconda3\lib\site-packages (from sqlalchemy_utils) (1.4.39)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\x473970\appdata\local\anaconda3\lib\site-packages (from SQLAlchemy>=1.3->sqlalchemy_utils) (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

import pymysql
pymysql.install_as_MySQLdb()

# ![title](Client_books.png)

In [3]:
# Create connection string using credentials following this format
username = "root"
password = "root" # (or whatever password you chose during mysql installation)
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [4]:
engine = create_engine(connection)

In [9]:
# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [10]:
df_users = pd.read_csv('users.csv')
df_users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [11]:
df_books = pd.read_csv('books.csv')
df_books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [12]:
df_authors = pd.read_csv('authors.csv')
df_authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [13]:
df_favourites = pd.read_csv('favourites.csv')
df_favourites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [14]:
df_users.to_sql('users', engine, if_exists = 'replace')
df_books.to_sql('books', engine, if_exists = 'replace')
df_favourites.to_sql('favourites', engine, if_exists = 'replace')
df_authors.to_sql('authors', engine, if_exists = 'replace')

5

In [15]:
query="SELECT table_name FROM information_schema.tables WHERE table_schema = 'books'"

In [16]:
pd.read_sql(query, engine)

   TABLE_NAME
0     authors
1       books
2  favourites
3       users

In [19]:
query= """
SELECT books.title, favourites.user_id
FROM books
JOIN favourites ON books.id = favourites.book_id
WHERE favourites.user_id = (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
"""

In [20]:
pd.read_sql(query, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1